tutorials/mesh/snappyHexMesh/motorBike_leakDetection/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# Alternative decomposeParDict name:
decompDict="-decomposeParDict system/decomposeParDict.6"
## Standard decomposeParDict name:
# unset decompDict

runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication $decompDict decomposePar

# Using distributedTriSurfaceMesh?
if foamDictionary -entry geometry -value system/snappyHexMeshDict | \
   grep -q distributedTriSurfaceMesh
then
    runParallel $decompDict surfaceRedistributePar motorBike.obj independent
fi

runParallel $decompDict snappyHexMesh -overwrite

runParallel $decompDict checkMesh -writeFields '(nonOrthoAngle)' -constant

#------------------------------------------------------------------------------
